/*
const numbers = [5, 8, -1, '-6', 11, 'ololo', '-2'];
let sum = 0;

for (let i = 0; i < numbers.length; i++) {
  sum += numbers[i];
}

alert('Sum is ' + sum);

———————————————

Кроки:

1. Оголосити масив numbers.
2. Присвоїти numbers значення [5, 8, -1, '-6', 11, 'ololo', '-2'].
3. Оголосити змінну sum.
4. Присвоїти sum початкове значення 0.
5. Оголосити змінну i.
6. Присвоїти i початкове значення 0.
7. Почати цикл: перевірити, чи i < numbers.length (довжина масиву дорівнює 7, отже, 0 < 7 — так).
8. До sum додати значення numbers[0] (тобто 5): sum = 0 + 5 = 5.
9. Збільшити i на 1:  i = 1.
10. Перевірити, чи i < numbers.length (1 < 7 — так).
11. До sum додати значення numbers[1] (тобто 8): sum = 5 + 8 = 13.
12. Збільшити i на 1: i = 2.
13. Перевірити, чи i < numbers.length (2 < 7 — так).
14. До sum додати значення numbers[2] (тобто -1): sum = 13 + (-1) = 12.
15. Збільшити i на 1: i = 3.
16. Перевірити, чи i < numbers.length (3 < 7 — так).
17. До sum додати значення numbers[3] (тобто '-6'): sum = 12 + '-6' = '12-6' (конкатенація, оскільки '-6' — рядок). 
Далі рахує неправильно

Щоб виправити Баг, потрібно відкинути нечислові значення і рядки перетворювати до числа:

const numbers = [5, 8, -1, '-6', 11, 'ololo', '-2'];
let sum = 0;

for (let i = 0; i < numbers.length; i++) {
    if (!isNaN(numbers[i])) {
        sum += +numbers[i]; 
    }
}

alert('Sum is ' + sum);
*/